config/cf/Catalogs/ГруппыКанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ГруппыКанбанДоски</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГруппКанбанДоски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отображать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьЛимитЗадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛимитЗадач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСортировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СортировкаКанбанДоски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроцессов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПроцесса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/СостоянияЭтаповПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подпроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыГруппКанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыГруппКанбанДоски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭтапа</Name>
					<Comment>//0 - этап, 1 - подпроцесс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьКомментарий</Name>
					<Comment>0 - не запрашивать, 1 - необязательный, 2 - обязательный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРамкиКанбанДоски</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/ГруппыКанбанДоски/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные этапы процессов.
//
Процедура ЗаполнитьГруппыКанбанДоскиПриПервоначальномЗаполнении() Экспорт
	
	// Описываем структуру
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("Отображать");
	ТЗ.Колонки.Добавить("Комментарий");
	
	ТЗ.Колонки.Добавить("ЭтапыПроцессов");
	
	ВД = Справочники.ГруппыКанбанДоски;
	
	// Заполняем реквизитами
	
	// НОВЫЕ
	НоваяСтрока = ДобавитьВТаблицуЗначений(ТЗ,	ВД.Новые,			НСтр("ru = 'Новые'"), 	Истина, 
		НСтр("ru = 'Сюда попадают все новые задачи'"));
	ДобавитьКолонкиВЭтапыПроцесса(НоваяСтрока.ЭтапыПроцессов);
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Новый);
	ДобавитьВТаблицуЗначенийЭтапы(НоваяСтрока.ЭтапыПроцессов, Массив);
	
	// Backlog
	НоваяСтрока = ДобавитьВТаблицуЗначений(ТЗ,	ВД.Backlog,			НСтр("ru = 'Backlog'"), Истина, 
		НСтр("ru = 'Все задачи, которые мы запланировали выполнить в текущем спринте'"));
	ДобавитьКолонкиВЭтапыПроцесса(НоваяСтрока.ЭтапыПроцессов);
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Бэклог);
	ДобавитьВТаблицуЗначенийЭтапы(НоваяСтрока.ЭтапыПроцессов, Массив);
	
	// В РАБОТЕ
	НоваяСтрока = ДобавитьВТаблицуЗначений(ТЗ,	ВД.ВРаботе,			НСтр("ru = 'В работе'"), Истина,  
		НСтр("ru = 'Все задачи, над которыми работаем в данный момент'"));
	ДобавитьКолонкиВЭтапыПроцесса(НоваяСтрока.ЭтапыПроцессов);
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.ВРаботе);
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Подготовка);
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Подпроцесс);
	ДобавитьВТаблицуЗначенийЭтапы(НоваяСтрока.ЭтапыПроцессов, Массив);
	
	// ВЫПОЛНЕНЫ
	НоваяСтрока = ДобавитьВТаблицуЗначений(ТЗ,	ВД.Выполненные,		НСтр("ru = 'Выполненные'"),	Истина,
		НСтр("ru = 'Задачи, которые были выполнены'"));
	ДобавитьКолонкиВЭтапыПроцесса(НоваяСтрока.ЭтапыПроцессов);
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Выполнен);
	ДобавитьВТаблицуЗначенийЭтапы(НоваяСтрока.ЭтапыПроцессов, Массив);
	
	// ЗАВЕРШЕННЫЕ
	НоваяСтрока = ДобавитьВТаблицуЗначений(ТЗ,	ВД.Завершенные,		НСтр("ru = 'Завершенные'"), Ложь, 
		НСтр("ru = 'Задачи, которые были завершены (нет изменений в течении какого-то времени)'"));
	ДобавитьКолонкиВЭтапыПроцесса(НоваяСтрока.ЭтапыПроцессов);
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостоянияЭтаповПроцесса.Закрыт);
	ДобавитьВТаблицуЗначенийЭтапы(НоваяСтрока.ЭтапыПроцессов, Массив);
	
	// Записываем
	Для Каждого Строки Из ТЗ Цикл
		
		Объект 			= Строки.Объект.ПолучитьОбъект();
        Объект.ВидГруппы = Перечисления.ВидыГруппКанбанДоски.Этапы;
        
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		
		Объект.ЭтапыПроцессов.Очистить();
		Для Каждого СтрокиЭтапов Из Строки.ЭтапыПроцессов Цикл
			ЗаполнитьЗначенияСвойств(Объект.ЭтапыПроцессов.Добавить(), СтрокиЭтапов);
		КонецЦикла;
		
		Объект.Записать();
		
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в таблицу значений данные
//
// Параметры:
//   нет
//
Функция ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, Отображать, Комментарий)
	
	НоваяСтрока 				= ТЗ.Добавить();
	НоваяСтрока.Объект			= Объект;
	НоваяСтрока.Наименование	= Наименование;
	НоваяСтрока.Отображать		= Отображать;
	НоваяСтрока.Комментарий		= Комментарий;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДобавитьКолонкиВЭтапыПроцесса(ЭтапыПроцессов);
	
	ЭтапыПроцессов = Новый ТаблицаЗначений;
	ЭтапыПроцессов.Колонки.Добавить("ЭтапПроцесса");
	
КонецПроцедуры

Процедура ДобавитьВТаблицуЗначенийЭтапы(ТЗ, МассивСостояний)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыПроцессов.Ссылка КАК ЭтапПроцесса
		|ИЗ
		|	Справочник.ЭтапыПроцессов КАК ЭтапыПроцессов
		|ГДЕ
		|	ЭтапыПроцессов.СостояниеЭтапа В(&МассивСостояний)";
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
